joshgoebel/hardware_arduboy/avr/boards.txt
#menu.cpu=Run Arduboy
menu.version=Version

##############################################################

arduboy.name=Arduboy
#arduboy.menu.cpu.speed16mhz=at full speed (16MHz)
#arduboy.menu.cpu.speed16mhz.build.f_cpu=16000000L
#arduboy.menu.cpu.speed16mhz.bootloader.extended_fuses=0xcb
#arduboy.menu.cpu.speed8mhz=with speed reduced to 8MHz
#arduboy.menu.cpu.speed8mhz.build.f_cpu=8000000L
#arduboy.menu.cpu.speed8mhz.bootloader.extended_fuses=0xcb
#arduboy.menu.cpu.speed8mhz.build.extra_flags=-DARDUBOY_16MHZ_HW_CLOCK=yes {build.usb_flags}

arduboy.menu.version.arduboy10=Release 1.0
arduboy.menu.version.arduboy10.build.extra_flags=-DARDUBOY_10=yes {build.usb_flags}
arduboy.menu.version.devkit=Development Kit
arduboy.menu.version.devkit.build.extra_flags=-DAB_DEVKIT=yes {build.usb_flags}

arduboy.upload.tool=avrdude
arduboy.upload.protocol=avr109
arduboy.upload.maximum_size=28672
arduboy.upload.maximum_data_size=2560
arduboy.upload.speed=57600
arduboy.upload.disable_flushing=true
arduboy.upload.use_1200bps_touch=true
arduboy.upload.wait_for_upload_port=true

arduboy.bootloader.tool=arduino:avrdude
arduboy.bootloader.low_fuses=0xff
# Low fuses
# 1 / Divide clock by 8
# 1 / Clock output on PORTC7
# 1 / Select start-up time
# 1 /   14CK + 65ms
# 1 / Select Clock source (CKSEL3)
# 1 /   8.0 - 16.0MHz  (CKSEL2)
# 1 / CKSEL1
# 1 / CKSEL0
arduboy.bootloader.high_fuses=0xd8
# High fuses
# 1 / Enable OCD - (disabled)
# 1 / Enable JTAG - (disabled)
# 0 / Enable Serial Program and Data Downloading - (enabled)
# 1 / Watchdog Timer always on - (disabled)
# 1 / EEPROM memory is preserved through the Chip Erase - (not preserved)
# 0 / BOOTSZ1 - 4,096 bytes bootloader size
# 0 / BOOTSZ0
# 0 / BOOTRST - reset vector is bootloader
#arduboy.bootloader.extended_fuses=0xcb
# Extended fuses
# 1 / -
# 1 / -
# 0 / -
# 0 / -
# 1 / Hardware Boot Enable
# 0 / Brown-out Detector trigger level (BODLEVEL2)
# 1 /   2.6v (BODLEVEL1)
# 1 / BODLEVEL0
arduboy.bootloader.file=caterina/Caterina-Leonardo.hex
arduboy.bootloader.unlock_bits=0x3F
arduboy.bootloader.lock_bits=0x2F

arduboy.build.mcu=atmega32u4
arduboy.build.f_cpu=16000000L
arduboy.build.vid=0x2341
arduboy.build.pid=0x8036
arduboy.build.usb_product="Arduino Leonardo"
arduboy.build.board=AVR_LEONARDO
arduboy.build.core=arduino:arduino
arduboy.build.variant=arduino:leonardo
arduboy.build.extra_flags={build.usb_flags}
